//+------------------------------------------------------------------+
//|                                               GraphUtilities.mqh |
//|                        Copyright 2013, MetaQuotes Software Corp. |
//|                                              http://www.mql5.com |
//+------------------------------------------------------------------+
#property copyright "Copyright 2013, MetaQuotes Software Corp."
#property link      "http://www.mql5.com"
//+------------------------------------------------------------------+
//| Библиотека, содержащая необходимые константы, перечисления и др. |
//+------------------------------------------------------------------+

//--------------------------------------------------------------------

//+------------------------------------------------------------------+
//| Тип контейнеров для хранения элементов                           |
//+------------------------------------------------------------------+
enum CONTAINER_TYPE   
 {
  C_TEXT=0,   //текстовое поле
  C_BUTTON,   //кнопка
  C_INPUT     //поле ввода
 };
//+------------------------------------------------------------------+
//| Ошибки при работе с графической библиотекой                      |
//+------------------------------------------------------------------+ 
enum GRAPH_ERR
 {
  GE_NO_ERRORS  = 0,        //без ошибок
  GE_CANNOT_CREATE,         //не возможно создать объект в контейнере
  GE_CANNOT_EDIT_BUTTON,    //не возможно отредактировать кнопку
  GE_CANNOT_RENAME,         //не возможно переименовать 
  GE_OBJECT_NOT_CREATED,    //графический объект не создан
  GE_OBJECT_CREATED,        //графический объект успешно создан
 };