//+------------------------------------------------------------------+
//|                                                    Constants.mqh |
//|                        Copyright 2013, MetaQuotes Software Corp. |
//|                                              http://www.mql5.com |
//+------------------------------------------------------------------+
#property copyright "Copyright 2013, MetaQuotes Software Corp."
#property link      "http://www.mql5.com"
//+------------------------------------------------------------------+
//| Файл с константами и прочими значениями                          |
//+------------------------------------------------------------------+

// размеры лота для разных валют
#define LOT_EURUSD 100000
    