//+------------------------------------------------------------------+
//|                                                  CTihiroIndi.mqh |
//|                        Copyright 2013, MetaQuotes Software Corp. |
//|                                              http://www.mql5.com |
//+------------------------------------------------------------------+
#property copyright "Copyright 2013, MetaQuotes Software Corp."
#property link      "http://www.mql5.com"
//+------------------------------------------------------------------+
//| Класс для индикатора TIHIRO                                      |
//+------------------------------------------------------------------+

