//+------------------------------------------------------------------+
//|                                                TesterDivStoc.mq5 |
//|                        Copyright 2013, MetaQuotes Software Corp. |
//|                                              http://www.mql5.com |
//+------------------------------------------------------------------+
#property copyright "Copyright 2013, MetaQuotes Software Corp."
#property link      "http://www.mql5.com"
#property version   "1.00"
//+------------------------------------------------------------------+
//| Скрипт тестирования актуальности расхождения стохастика          |
//+------------------------------------------------------------------+
void OnStart()
  {

  }