//+------------------------------------------------------------------+
//|                                                     TestFunc.mqh |
//|                        Copyright 2013, MetaQuotes Software Corp. |
//|                                              http://www.mql5.com |
//+------------------------------------------------------------------+
#property copyright "Copyright 2013, MetaQuotes Software Corp."
#property link      "http://www.mql5.com"
//+------------------------------------------------------------------+
//| Библиотека тестовых функций                                      |
//+------------------------------------------------------------------+
//----  
//+------------------------------------------------------------------+
//| Возвращает флаг тестера                                          |
//+------------------------------------------------------------------+ 
bool IsTester()
  {
   return(MQL5InfoInteger(MQL5_TESTER));
  }
//+------------------------------------------------------------------+
//| Возвращает флаг оптимизации                                      |
//+------------------------------------------------------------------+
bool IsOptimization()
  {
   return(MQL5InfoInteger(MQL5_OPTIMIZATION));
  }
//+------------------------------------------------------------------+
//| Возвращает флаг визуального режима тестирования                  |
//+------------------------------------------------------------------+
bool IsVisualMode()
  {
   return(MQL5InfoInteger(MQL5_VISUAL_MODE));
  }
//+------------------------------------------------------------------+
//| Возвращает флаг режима реального времени вне тестера,            |
//| если все условия выполняются                                     |
//+------------------------------------------------------------------+
bool IsRealtime()
  {
   if(!IsTester() && !IsOptimization() && !IsVisualMode())
     return(true);
   else
     return(false);
  }